IDENTIFICATION DIVISION.
PROGRAM-ID. "TESTING".
AUTHOR. "KLEAN KODE".INSTALLATION. "1".
DATE-WRITTEN. "04/04/2024".DATE-COMPILED. "04/04/2024".
DATA DIVISION.
01 CR PICTURE IS 99.
01 III PICTURE IS 99.
01 ACCOUNTNUMBER PICTURE IS 9.
01 ACCOUNT-NUMBER PICTURE IS 9.
01 ACCOUNT PICTURE IS 9.
01 NUMBER PICTURE IS 9.
01 new PICTURE IS A.
02 MS PICTURE IS 9.
PROCEDURE DIVISION.

COPY "Copy.txt" REPLACING ===FILE=== BY ===PROGRAM===.

LOOP
    VARYING III FROM 3 TO 7 BY 1
    DISPLAY III
END.

LOOP
    WHILE III < 11
    DISPLAY III
    ADD 1 TO III
END.

LOOP
    UNTIL III = 14
    DISPLAY III
    ADD 1 TO III
END.


LOOP
    UNTIL III = 16
    IF III = 15 THEN GO TO T END
    ADD 1 TO III
END.

DISPLAY "WILL NOT BE SHOWN!".

T. DISPLAY "TESTING PERFORM".
PERFORM T 3 TIMES.

B. DISPLAY "B" WITH NO ADVANCING.
C. DISPLAY "C" WITH NO ADVANCING.
PERFORM B THROUGH C.

MOVE 4 TO ACCOUNTNUMBER.
DISPLAY ACCOUNTNUMBER.

Q. DISPLAY "ALTER STATEMENT".
ALTER T TO PROCEED TO Q.
PERFORM T.

DISPLAY 123.
ADD 1 2 3 TO 5 GIVING e.
ADD 1 2 3 TO cr.
DISPLAY e.
DISPLAY CR.
MULTIPLY 2 BY 5 GIVING m.
DISPLAY m.
SUBTRACT 1 2 3 FROM 10 GIVING p.
DISPLAY p.
DIVIDE 3 INTO 10 GIVING d.
DISPLAY d.
IF cr = 6 THEN DISPLAY "CR is 6" END.
DISPLAY "EVALUATE BLOCK:".

EVALUATE cr ALSO d
    WHEN 5 ALSO 3
        DISPLAY "CR IS 5! AND D IS 3!"
    WHEN 6 ALSO 3
        DISPLAY "CR IS 6! AND D IS 3!"
    WHEN OTHER
        DISPLAY "CR IS NOT 6! OR D IS NOT 3!"
END.
ACCEPT ACCOUNTNUMBER ACCOUNT-NUMBER ACCOUNT NUMBER.
IF ACCOUNT-NUMBER = 0 THEN DISPLAY 1234 END.
IF ACCOUNT - NUMBER = 0 THEN DISPLAY 555 END.

NEXT SENTENCE "DEAD CODE HERE".
EVALUATE cr ALSO d
    WHEN 6 ALSO 3
        DISPLAY "Next sentence!" NEXT SENTENCE
    WHEN OTHER
        DISPLAY "UNREACHABLE"
END.
DISPLAY "TESTING NEXT SENTENCE AT THE END" NEXT SENTENCE.
STOP.