IDENTIFICATION DIVISION.
PROGRAM-ID. "TESTING".
AUTHOR. "KLEAN KODE".INSTALLATION. "1".
DATE-WRITTEN. "04/04/2023".DATE-COMPILED. "04/04/2023".
DATA DIVISION.
01 CR PICTURE IS 99.
02 MS PICTURE IS 99.
PROCEDURE DIVISION.
DISPLAY 123.
ADD 1 2 3 TO 5 GIVING e.
ADD 1 2 3 TO CR.
DISPLAY e.
DISPLAY CR.
MULTIPLY 2 BY 5 GIVING m.
DISPLAY m.
SUBTRACT 1 2 3 FROM 10 GIVING p.
DISPLAY p.
DIVIDE 3 INTO 10 GIVING d.
DISPLAY d.